### 5. 데이터전처리 완료데이터 / 분석 집계데이터 합치기

In [71]:
refinedSelloutData.head(4)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02

In [72]:
groupData.head()

  REGIONID    PRODUCT  YEAR    QTY_MEAN
0      A00  PRODUCT34  2014  275.961538
1      A00  PRODUCT34  2015   86.634615
2      A00  PRODUCT34  2016   36.576923
3      A00  PRODUCT58  2014    2.673077
4      A00  PRODUCT58  2015    5.711538

In [73]:
joinKey = ["REGIONID","PRODUCT","YEAR"]
joinKey

['REGIONID', 'PRODUCT', 'YEAR']

In [74]:
mergedData = pd.merge(refinedSelloutData,groupData,\
         left_on=joinKey, right_on=joinKey) \
[["REGIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN"]]

In [75]:
mergedData.head()

  REGIONID   PRODUCT YEARWEEK  YEAR WEEK  QTY_NEW   QTY_MEAN
0      A60  PRODUCT4   201402  2014   02     71.0  29.134615
1      A60  PRODUCT4   201401  2014   01     16.0  29.134615
2      A60  PRODUCT4   201403  2014   03     51.0  29.134615
3      A60  PRODUCT4   201406  2014   06     19.0  29.134615
4      A60  PRODUCT4   201404  2014   04     21.0  29.134615